{"basics":{"name":"Frederik Ciupek","label":"Asset Management","image":"","email":"frederik.ciupek@yale.edu","phone":"(203) 503-4945","url":"https://github.com/frederikciupek","summary":" I am a native German finance enthusiast and creative problem solver who is passionate about leveraging alternative data to drive innovation in finance, economics, and business. Recent research interest incldue the impact of amazon review data on stock performance, reliability of M&A peer groups and multiple misvaluation as well as defensive portoflio strategies using factors and optimization.","location":{"address":"66 Warren St, unit 2","postalCode":"CT 06511","city":"New Haven","countryCode":"US","region":"Connecticut"},"profiles":[{"network":"Twitter","username":"AlbertEinstein","url":"https://twitter.com/AlbertEinstein"}]},"work":[{"name":"YALE SCHOOL OF MANAGEMENT","position":"Research Assistant Merger Arbitrage & Empirical Asset Pricing","url":"https://som.yale.edu/faculty-research/faculty-directory/theis-ingerslev-jensen","startDate":"2024-11-15","endDate":"2025-05-19","summary":"Together with Porfessor Theis Jensen I am working on a research project that investigates the impact of M&A peer group selection on the reliability of multiples in valuation. The project aims to develop a comprehensive framework for evaluating M&A peer groups and their influence on valuation accuracy. ","highlights":["Engineered a scalable Python ETL pipeline leveraging BeautifulSoup and OpenAI’s Batch API to extract, normalize, and standardize data from 10,000+ SEC M&A filings - culminating in a comprehensive multiples benchmark to rigorously evaluate ML model performance.","Using Manhattan distance enhanced relative valuation accuracy by ~ 20% through a comparative analysis of four industry lassification systems in Python, optimizing firm valuation using inter- and intra-industry multiples (EV/EBIT, EV/SALES, P/B, P/E) reporting findings in weekly team meetings"]},{"name":"DELOITTE GERMANY JAPANESE SERVICES GROUP (JSG)","position":"International Business Tax Intern","url":"https://www.deloitte.com/de/de/services/consulting/services/japanese-services-group.html","startDate":"2024-05-01","endDate":"2024-07-01","summary":"Part of the globally active Japanese Service Group (JSG), I worked with the German team based in Duesseldorf to oversee Japanese companies entering the German market by setting up subsidiaries or acquiring existing ones (inbound). My responsibilities included coordinating cross-border tax and legal advisory services, facilitating communication between Japanese clients and German stakeholders, and ensuring smooth integration into the local regulatory and business environment. This role required a strong understanding of both Japanese corporate culture and German regulatory frameworks, as well as close collaboration with multidisciplinary teams across both countries.","highlights":["Optimized tax efficiency, reducing transfer pricing-related tax burdens for Japanese firms acquiring German subsidiaries, supporting RFP documentation, M&A tax due diligence, and post-merger integrations.","Led a cross‑functional team of five to architect and deploy multilingual (DE, EN, JP) email, social and webinar campaigns using HubSpot - driving a 300% surge in target‑account engagement over three months."]},{"name":"MERCER | HKP/// GROUP Frankfurt, Germany","position":"Executive Compensation Consulting Intern","url":"https://www.mercer.com/de-de/solutions/corporate-governance/","startDate":"2024-01-01","endDate":"2024-04-30","summary":"Interning in the Corporate Governance Adivosry, focusing on Executive Compensation Consulting, I supported the team in analyzing and benchmarking executive compensation packages for DAX, MDAX and SDAX clients across various industries in the DACH region..","highlights":["Advised DAX, MDAX, and SDAX  institutional clients (board of directors) on corporate governance, providing recommendations for board size, compensation schemes (long & short-term incentives), and KPI management by comparing complex compensation systems against industry benchmarks, saving one client over €1M.","Engineered Python scripts to parse and validate four years of proxy reports for 160 German public firms (DAX, MDAX, SDAX) and created an interactive excel dashboard - streamlining data cleaning by 40% and delivering actionable governance insights for the 2024 ECBE Corporate Governance study saving 80 hours of manual work."]},{"name":"QUONIAM ASSET MANAGEMENT GMBH","position":"Fixed Income Quantitative Research Intern","url":"https://www.quoniam.com/en/","startDate":"2023-09-01","endDate":"2023-12-31","summary":"Quoniam Asset Management GmbH is a Frankfurt-based quantitative asset manager specializing in systematic fixed-income strategies, being the second biggest quantiative fixed income fund in Europe. I contributed to the running multi-factor fixed income signal by integrating local vs. FX-hedged returns and analyzed bond trading data.","highlights":["Designed and backtested a novel fixed-income momentum spillover factor in Python—integrating local vs. FX-hedged returns and sourcing data (e.g., Ravenpack)—which reduced maximum drawdowns in a multifactor strategy by 10%.","Leveraged Python, SQL, and Bloomberg to analyze TRACE bond-trading data, proposed a new relative liquidity metric that expanded the liquid universe by 13% for investment-grade and high-yield bonds in EUR and USD.","Enhanced five internal Python libraries with additional FX parameterization to account for specific FX effects; built and maintained scripts for client-pitch presentation materials, reducing prep time by 5 hours per pitch."]}],"volunteer":[{"organization":"Coach for High School Students","location":"Berlin, Geramny","position":"Volunteer Coach","url":"https://frederikciupek.github.io/people/","startDate":"2025-03-01","endDate":"Ongoing","summary":"Having received a standard public education in Germany and by luck more than anything else attending an Ivy League school without any guidance or mentorship, I am passionate about giving back to the community and helping high school / college students in Germany prepare for their future, showing them opportunities that they had maybe not known about.","highlights":["Organized and led an informational session in collaboration with the Hedge Fund Club at the University of Mannheim, offering guidance on breaking into the quantitative finance industry. Covered key topics including required technical skills, industry expectations, and effective networking strategies.","Collaboration with my high school Japanese teacher, delivering a session on career opportunities in Japan. Shared insights from two years of study at Waseda University—Japan’s top university - and experiences attending multiple Japanese career fairs, providing students with practical advice on navigating education and work prospects in Japan."]}],"education":[{"institution":"Yale School of Management","location":"New Haven, USA","url":"https://som.yale.edu/programs/mms-asset-management","area":"Financial Mathematics (Asset Management) - STEM Designation","studyType":"Master","startDate":"2024-08-14","endDate":"2025-05-19","score":"High Honors","courses":["Asset Pricing Thoery","Behavioral Finance","Quantiative Investing","Fixed Income Strategies","Macroeconomic Strategies","Fixed Income Securities – Bonds, Swaps, and Derivatives","Portfolio Management in Practice","Machine Learning & Financial Econometrics","Large Language Models: Technology and Applications","Data Analysis and Causal Inference "]},{"institution":"Mannheim University","location":"Mannheim, Germany","url":"https://www.bwl.uni-mannheim.de/en/programs/bachelor/bachelor-in-business-administration-1/","area":"B.Sc in Business Administration","studyType":"Bachelor","startDate":"2020-10-01","endDate":"2023-07-01","score":"1.4 (German Grade)","courses":["Microeconomics","Investments and Asset Pricing","Corporate Finance and Risk Management","Introduction to Macroeconomics","Financial Accounting","Managerial Accounting","Business Law","Civil Law","Organizational Behavior","Marketing Management","Strategic & International Management","Advanced Japanese Studies"]},{"institution":"Waseda University","location":"Tokyo, Japan","url":"https://www.waseda.jp/top/en","area":"Commerce / Economics","studyType":"Exchange Program","startDate":"2022-09-01","endDate":"2023-02-12","score":"A+ (Japanese Grade","courses":["Comprehensive Japanese 6 (Highest Level)","Innovation for the New World Order: Winning Strategies for Asia?","International Business Law","Financial Institutions and Markets","Financial Economics","Introduction to Data Science","Japanese Business History"]}],"awards":[{"title":"Promos Scholarship for Academic Excellence","date":"2023","awarder":"German Academic Exchange Service (DAAD)","url":"https://www.daad.de/en/","summary":"Awarded the Promos Scholarship for Academic Excellence by the German Academic Exchange Service (DAAD) for outstanding academic performance during the exchange program at Waseda University in Tokyo, Japan."},{"title":"Annual KPG Tax Quiz (2022)","date":"2022","awarder":"5th place","url":"","summary":"Awarded the 5th place in the Annual KPG Tax Quiz, a University of Mannheim compeititon for 2nd year Business Administration students organized by KPMG Germany, which tests knowledge of tax law and regulations for income tax."}],"certificates":[{"name":"Finance Accelerator","date":"Jul 2024","issuer":"AmplifyME","url":"https://amplifyme.com/finance-accelerator","icon":"","skills":["Asset Management","Trading","Risk Management"]},{"name":"Japanese-Language Proficiency Test N1","date":"Jul 2024","issuer":"JLPT - Japanese Language Proficiency Test","url":"https://www.jlpt.jp/sp/e/about/levelsummary.html","icon":"","skills":["Japanese Language Proficiency","Japanese Culture"]},{"name":"Python Fundamentals","date":"Jul 2024","issuer":"DataCamp","url":"","icon":"","skills":["Python (Programming Language)","Data Analysis"]},{"name":"Statistics Fundamentals with Python","date":"Jul 2024","issuer":"DataCamp","url":"","icon":"","skills":["Python (Programming Language)","Data Analysis","Statistics"]},{"name":"Time Series with Python","date":"Jul 2024","issuer":"DataCamp","url":"","icon":"","skills":["Time Series Analysis","Machine Learning","Python (Programming Language)"]},{"name":"TOEFL iBT 120/120","date":"Jan 2022","issuer":"ETS","url":"https://www.ets.org/toefl.html","icon":"","skills":[]}],"publications":[{"name":"The Impact of Amazon Reviews on Stock Performance","publisher":"Unpublished Bachelor’s thesis, University of Mannheim , Germany","releaseDate":"2023-06-30","url":"https://frederikciupek.github.io/assets/pdf/Thesis_Frederik_Ciupek.pdf","summary":"This thesis investigates how abnormal customer ratings from Amazon reviews predict stock returns—demonstrating that U.S. firms with higher-than-expected review scores earn significant abnormal returns (especially pre-2015) and that this effect diminishes as online review data become more pervasive, with a supplemental case study of Japanese Amazon reviews supporting similar conclusions"}],"skills":[{"name":"Finance","level":"Advanced","icon":"fa-solid fa-chart-line","keywords":["Asset Management","Quantitative Investing","Fixed Income Strategies","Portfolio Optimization","Risk Management","Behavioral Finance","Empirical Asset Pricing"]},{"name":"Programming","level":"Advanced","icon":"fa-solid fa-code","keywords":["Python","SQL","Machine Learning","Data Analysis","Time Series Analysis","ETL Pipelines","Bloomberg Terminal"]},{"name":"Languages","level":"Expert","icon":"fa-solid fa-language","keywords":["German (Native)","English (Fluent)","Japanese (Proficient)"]},{"name":"Business","level":"Advanced","icon":"fa-solid fa-briefcase","keywords":["Corporate Finance","Strategic Management","Marketing","Organizational Behavior","Business Law","Managerial Accounting","Financial Accounting"]}],"languages":[{"language":"German","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent (Native Proficiency)","icon":""},{"language":"Japanese","fluency":"Full Working Proficiency","icon":""}],"interests":[{"name":"Public Markets & Economics","icon":"fa-solid fa-chart-line","keywords":["Stock Markets","Market Trends","Economic Analysis","Trading Strategies","Bond Trading","Interest Rates","Yield Curves Analysis"]},{"name":"Weightlifting","icon":"fa-solid fa-dumbbell","keywords":["Strength Training","Powerlifting","Bodybuilding","Nutrition"]},{"name":"Coffee","icon":"fa-solid fa-mug-hot","keywords":["Coffee History","Brewing Techniques","Specialty Coffee","Pour Overs"]},{"name":"Sailing","icon":"fa-solid fa-anchor","keywords":["Navigation","Knots"]},{"name":"Large Language Models","icon":"fa-solid fa-brain","keywords":["Artificial Intelligence","Limits to AI","Natural Language Processing","Machine Learning","Generative AI"]},{"name":"Japan","icon":"fa-solid fa-mountain","keywords":["Japanese Culture","Japanese Language","Travel in Japan","Japanese History"]}],"references":[{"name":"Professor Theis Jensen, ","icon":"fa-solid fa-laptop","reference":"Professor Theis Jensen has been my mentor and supervisor at Yale School of Management, guiding my research in empirical asset pricing and M&A peer group analysis. His expertise in quantitative finance has been invaluable to my academic and professional development."},{"name":"Assistant Professor Jiri Tresl, PhD (Mannheim University)","icon":"fa-solid fa-graduation-cap","reference":"Assistant Professor Jiri Tresl has been instrumental in my academic journey, providing mentorship and guidance during my studies at Mannheim University where I worked as his Teaching Assistant conducting. His support is the only reason why I am where I am today and I am grateful for his guidance and support throughout my academic journey."},{"name":"Iris Mönnich (Partner, Deloitte JSG)","icon":"fa-solid fa-thumbtack","reference":"Iris Mönnich, a Partner at Deloitte's Japanese Services Group, has been a key mentor during my internship. Her expertise in international business tax and her guidance on cross-border transactions have significantly enhanced my understanding of the complexities involved in advising Japanese companies entering the German market."},{"name":"Dr. Lars Rickenberg (Quantiative Researcher, Quoniam Asset Management)","icon":"fa-solid fa-briefcase","reference":"Dr. Lars Rickenberg, a Quantitative Researcher at Quoniam Asset Management, has been a mentor during my internship in the fixed income group. His expertise in fixed-income strategies and quantitative research has greatly influenced my understanding of systematic investment approaches and the integration of data analysis in asset management."}],"projects":[{"name":"Amazon Review Data and Stock Performance","summary":"This project investigates the relationship between Amazon review data and stock performance, analyzing how sentiment changes and volume of reviews can serve as indicators for stock price movements. The goal is to develop a predictive model that leverages alternative data to enhance investment strategies.","highlights":["FamaMcBeth Regression to reveal the source of the impact of Amazon review data on stock performance, showing that they can be used as a proxy / predictor of Earnings growth."],"startDate":"2024-10-01","endDate":"Ongoing","url":"https://frederikciupek.github.io/projects/amazon/"},{"name":"M&A Peer Group Reliability in Valuation","summary":"This project focuses on the reliability of M&A peer groups in valuation, analyzing how different peer group selection methods impact the accuracy of multiples used in M&A transactions. I focused mostly on the data gathering process.","highlights":["Using the sum of absolute rank differences method over five fundamental variables we can reduce valuation error of industry peer groups by up to 40%.","Utilizing LLMs and BeautifulSoup to extract and normalize selected company peer group valuation multiple data from 10,000+ SEC M&A filings, creating a comprehensive database of multiples to compare against our model."],"startDate":"2024-11-01","endDate":"Ongoing","url":"https://frederikciupek.github.io/projects/research-assistant/"}]}